// 22
//

#include "stdafx.h"
#include <math.h>
#include <iostream>
#include <conio.h>
#include <string>
#include <windows.h>
#include <fstream>

using namespace std;
void Zah1()
{
	std::vector<int> mas[10];

}

int main()
{
	//
	список стандартных функций проекта диалогового окна мфц
		1 конструктор запускается первым.В момент его работы окна не существует, пременные, назначенные на жлементы управления в окне авто появляются в конструкторе

		2 деструктор
		3 do data exchange работает пока окна не существует.Задача орган связь мкжду жлеменными управления и переменными, которые на них назначены
		4 oninitdialog после того как эта функция отработала, появляется окно
		5 OnPoint эта функция запускается последней среди стандартных.Ее задача : перерисовка клентской части окна(фона)
		пЕРЕрисовка стандартная происходится при изменении клиентской части
		карта событий - область, которая содержит перечень обрабатываемым окном событй
		massagebox(L"cxvfd");
	    на элементы управления можно добавить 1-2 переменных
			переменных бывает 2 категорий Control и value
 
		//
    return 0;
}

